christian-kohler.path-intellisense
eamodio.gitlens
github.codespaces
github.copilot
github.copilot-chat
github.github-vscode-theme
humao.rest-client
ms-azuretools.vscode-docker
ms-python.autopep8
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-vscode.cmake-tools
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
pkief.material-icon-theme
ritwickdey.liveserver
twxs.cmake
visualstudioexptteam.vscodeintellicode
wayou.vscode-todo-highlight
yzhang.markdown-all-in-one
